app/views/events/_new.html.haml

SELECT "locations".* FROM "locations" WHERE "locations"."account_id" = 4 LIMIT 1
---
- @event.account = account unless defined?(account).nil?
- @event.location = account.locations.first unless defined?(account.locations.first).nil?

SELECT "accounts".* FROM "accounts" ORDER BY name
---

      = f.association :account, include_blank: "Choose an Account", collection: Account.all.select{|a| a.active}

SELECT "events".* FROM "events" WHERE ((events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00') and (events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00')) ORDER BY events.id desc
---
              %i.icon-th
      = f.input :status, collection: Status::Event.available_values.collect{|c| [c.titleize, c]}, default: Status::Event.scheduled