app/controllers/accounts_controller.rb

  def index
    respond_with(@accounts = Kaminari.paginate_array(Account.all).page(params[:page]))
---
SELECT "accounts".* FROM "accounts" ORDER BY name

  def show
    respond_to do |format|

      format.html do
        if params[:xls] && !params[:meta_data].nil? && params[:meta_data] == "billing_references"
          redirect_to :action => "export_billing_references", :format => "xls", :searchable => params[:searchable], :direction => params[:direction], :sort => params[:sort]
        elsif params[:xls] && !params[:meta_data].nil? && params[:meta_data] == "events"
          redirect_to :action => "export_events", :format => "xls", :searchable => params[:searchable], :direction => params[:direction], :sort => params[:sort]
        else
          @account = Account.find(params[:id])
          @account_pricing_tiers = AccountPricingTier.find_all_by_account_id(params[:id])
          options = {:artificial_attributes => {"vendor"=>"vendors.name", "event_time" => "event_start_time", "date" => "event_start_time"}}
          @events = Kaminari.paginate_array(Event.includes(:account).includes(:vendors).where(:account_id => params[:id]).search_sort_paginate(params, options)).page(params[:page])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY name LIMIT 1  [["id", "4"]]
SELECT "account_pricing_tiers".* FROM "account_pricing_tiers" WHERE "account_pricing_tiers"."account_id" = 4 ORDER BY product
SELECT "events".* FROM "events" WHERE "events"."account_id" = 4 AND ((events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00') and (events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00')) ORDER BY events.id desc
SELECT COUNT(*) FROM "events" WHERE "events"."account_id" = 4 AND ((events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00') and (events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00'))