app/controllers/events_controller.rb

  def index
    options = {:artificial_attributes => {"vendor"=>"vendors.name","account"=>"accounts.name", "event_time" => "event_start_time", "date" => "event_start_time"}}
    respond_to do |format|
      format.html do
        if params[:xls]
          redirect_to :action => "index", :format => "xls", :searchable => params[:searchable], :direction => params[:direction], :sort => params[:sort]
        else
          @events = Kaminari.paginate_array(Event.includes(:account).includes(:vendors).search_sort_paginate(params, options)).page(params[:page])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" IN (36, 32, 28, 24, 20, 16, 12, 8) ORDER BY name
SELECT "events".* FROM "events" WHERE ((events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00') and (events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00')) ORDER BY events.id desc
SELECT COUNT(*) FROM "events" WHERE ((events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00') and (events.event_start_time between '2013-08-04 18:30:00' and '2013-08-25 18:30:00'))