app/views/accounts/_billing_reference_report_table.html.haml

SELECT "events".* FROM "events" WHERE "events"."account_id" = 4
---
              %td
              %td= number_to_currency @account.event_billing_reference(billing_reference_group, choice).flatten.inject(0) {|sum, br| sum + (events.include?(br.event) ? br.event.catering_total_billing.to_f : 0)}