app/views/accounts/_billing.html.haml

SELECT "billing_references".* FROM "billing_references" WHERE "billing_references"."account_id" = 4
---

- @account.billing_references.each do |reference|
  .modal.hide.fade{"id"=>"edit_billing_reference_form_" + reference.id.to_s}