app/views/accounts/_new.html.haml

      = f.input :account_type, collection: AccountType.available_values.collect{|c| [c.titleize, c]}
      = f.input :account_manager_id, collection: User.all, label_method: :username, value_method: :id, label: "Account Manager"
---
SELECT "accounts".* FROM "accounts" ORDER BY name
SELECT "users".* FROM "users"