app/views/accounts/_preferences.html.haml

        %tbody
          - @account.preferences.each do |p|
            .modal.hide.fade{"id"=>"edit_preference_form_" + p.id.to_s}
---
SELECT "preferences".* FROM "preferences" WHERE "preferences"."account_id" = 4